app/views/videos/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <%= form.label :category %>
    <%= form.select :category_id, Category.all.map {|c| [c.category, c.id]} %>