app/views/videos/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <br>
        <p> category: <%= Category.find(video.category_id.to_i).category %></p>