app/views/videos/show.html.erb


<% pre_like = @video.likes.find { |like| like.user_id == current_user.id} %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

      User:
      <%= User.find(comment.user_id.to_i).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]