app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Anime"], ["created_at", "2021-12-13 14:29:25.504874"], ["updated_at", "2021-12-13 14:29:25.504874"]]