app/controllers/comments_controller.rb

INSERT INTO "comments" ("video_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["video_id", 7], ["comment", "like"], ["created_at", "2021-12-13 14:07:07.157184"], ["updated_at", "2021-12-13 14:07:07.157184"]]
---
  def create
    if user_signed_in?
      @comment = Comment.new(comment_params)
      respond_to do |format|
        if @comment.save