app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @videos = Video.find

SELECT "categories"."id" FROM "categories" WHERE (category LIKE '%games%')
SELECT "categories"."id" FROM "categories" WHERE (category LIKE '%Super Idol%')
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "videos".* FROM "videos"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @categories = Category.all

    if params[:category].present?
      @videos = Video.where(["category_id IN (?)", Category.where(["category LIKE ?","%#{params[:category]}%"]).pluck(:id)])
    end

    if params[:title].present?
      @videos = Video.where(["title LIKE ?","%#{params[:title]}%"])
    end

    cate = params[:cate]
    if !cate.nil?
      @videos = Video.where(:category_id => cate)
    end

    if cate == 'all'
      @videos = Video.all
    end

    if cate.nil? && params[:category].nil? && params[:title].nil?
      @videos = Video.all

SELECT "comments".* FROM "comments"
---
  def show
    @comment = Comment.new
    @comments = Comment.all

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "videos" SET "updated_at" = ?, "likes" = ? WHERE "videos"."id" = ?  [["updated_at", "2021-12-13 13:56:36.371093"], ["likes", 1], ["id", 7]]
---
  def like

    if user_signed_in?

      @video = Video.find(params[:id])
      @video.likes = @video.likes + 1
      @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "videos" SET "updated_at" = ?, "likes" = ? WHERE "videos"."id" = ?  [["updated_at", "2021-12-13 14:30:36.871470"], ["likes", 1], ["id", 1]]
---
  def dislike
    if user_signed_in?

      @video = Video.find(params[:id])
      @video.likes = @video.likes - 1
      @video.save

INSERT INTO "videos" ("title", "description", "created_at", "updated_at", "category_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sieu nhan gao"], ["description", "1"], ["created_at", "2021-12-13 09:01:39.203536"], ["updated_at", "2021-12-13 09:01:39.203536"], ["category_id", 1], ["user_id", 1]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

UPDATE "videos" SET "updated_at" = ? WHERE "videos"."id" = ?  [["updated_at", "2021-12-13 15:40:47.242452"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @video.update(video_params)