app/controllers/videos_controller.rb

  def index
    @categories = Category.all

    if params[:category].present?
      @videos = Video.where(["category_id IN (?)", Category.where(["category LIKE ?","%#{params[:category]}%"]).pluck(:id)])
    end

    if params[:title].present?
      @videos = Video.where(["title LIKE ?","%#{params[:title]}%"])
    end

    cate = params[:cate]
    if !cate.nil?
      @videos = Video.where(:category_id => cate)
    end

    if cate == 'all'
      @videos = Video.all
    end

    if cate.nil? && params[:category].nil? && params[:title].nil?
      @videos = Video.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def myVideo
    # @video = current_user.Videos.all
    @videos = Video.all
---
SELECT "videos".* FROM "videos"

  def dislike
    if user_signed_in?

      @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    # @user = User.find_by(id: current_user.id)

    @video = Video.new(video_params)
    # @video = @user.videos.build(video_params)
    # @video.id = current_user.id
    # @video = Video.new(params[:video])
    @video.user_id = current_user.id

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("title", "description", "created_at", "updated_at", "category_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Kimetsu no Yaiba"], ["description", "Hay vl"], ["created_at", "2021-12-13 14:29:51.185282"], ["updated_at", "2021-12-13 14:29:51.185282"], ["category_id", 1], ["user_id", 1]]