app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("title", "description", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "Ronaldo"], ["description", "Ronaldo"], ["created_at", "2021-12-12 18:27:13.815150"], ["updated_at", "2021-12-12 18:27:13.815150"], ["category_id", 2]]